[Survived] Null coalescing mutation (remove right)
TodoApi/TodoApi/Authentication/TokenService.cs:41:19
         var section = bearerSection.GetSection("SigningKeys:0");
 
         var validIssuer = bearerSection["ValidIssuer"];
-        _issuer = validIssuer ?? "dotnet-user-jwts";
+        _issuer = "dotnet-user-jwts";
         var value = section["Value"];
         var signingKeyBase64 = value ?? "DCmbsZQIbC0VT3xssf+mkrAhpnVPw/x38jYliIg7Oas=";

[Killed] String mutation
TodoApi/TodoApi/Authentication/TokenService.cs:42:29
 
         var validIssuer = bearerSection["ValidIssuer"];
         _issuer = validIssuer ?? "dotnet-user-jwts";
-        var value = section["Value"];
+        var value = section[""];
         var signingKeyBase64 = value ?? "DCmbsZQIbC0VT3xssf+mkrAhpnVPw/x38jYliIg7Oas=";
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Null coalescing mutation (remove right)
TodoApi/TodoApi/Authentication/TokenService.cs:43:32
         var validIssuer = bearerSection["ValidIssuer"];
         _issuer = validIssuer ?? "dotnet-user-jwts";
         var value = section["Value"];
-        var signingKeyBase64 = value ?? "DCmbsZQIbC0VT3xssf+mkrAhpnVPw/x38jYliIg7Oas=";
+        var signingKeyBase64 = "DCmbsZQIbC0VT3xssf+mkrAhpnVPw/x38jYliIg7Oas=";
 
         var signingKeyBytes = Convert.FromBase64String(signingKeyBase64);
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] String mutation
TodoApi/TodoApi/Authentication/TokenService.cs:51:34
                 SecurityAlgorithms.HmacSha256Signature);
 
         _audiences = bearerSection.GetSection("ValidAudiences").GetChildren()
-                    .Where(s => !string.IsNullOrEmpty(s.Value))
+                    .Where(s => !(s.Value!=null))
                     .Select(s => new Claim(JwtRegisteredClaimNames.Aud, s.Value!))
                     .ToArray();
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos
