[Killed] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:31:9
             return TypedResults.BadRequest(BadRequestResponse.BuildFrom(result.Errors.ToDictionary(e => e.Code, e => new[] { e.Description })));
         }).DescribeCreateUser();
 
-        group.MapPost("/token", async Task<Results<BadRequest<BadRequestResponse>, Ok<TokenResponse>>> (CreateUserRequest userInfo, UserManager<TodoUser> userManager, ITokenService tokenService) =>
-        {
-            var user = await userManager.FindByNameAsync(userInfo.Username);
-
-            if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
-            {
-                var errors = new Dictionary<string, string[]>();
-                errors.Add("password", new string[] { "Invalid user or password" });
-                return TypedResults.BadRequest(BadRequestResponse.BuildFrom(errors));
-            }
-
-            return TypedResults.Ok(new TokenResponse(tokenService.GenerateToken(user.UserName!)));
-        }).DescribeToken();
+        ;
 
         return group;
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[NoCoverage] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:38:17
             if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
             {
                 var errors = new Dictionary<string, string[]>();
-                errors.Add("password", new string[] { "Invalid user or password" });
+                ;
                 return TypedResults.BadRequest(BadRequestResponse.BuildFrom(errors));
             }

[NoCoverage] String mutation
TodoApi/TodoApi/Users/UsersApi.cs:38:28
             if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
             {
                 var errors = new Dictionary<string, string[]>();
-                errors.Add("password", new string[] { "Invalid user or password" });
+                errors.Add("", new string[] { "Invalid user or password" });
                 return TypedResults.BadRequest(BadRequestResponse.BuildFrom(errors));
             }
