[Survived] Object initializer mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:27:17
         public static SwaggerGenOptions DescribeApi(this SwaggerGenOptions options)
         {
             options.SwaggerDoc("v1",
-                new OpenApiInfo
-                {
-                    Title = "Simple Todo API",
-                    Description = "API to manage a simple Todo List with user auth control.",
-                    Version = "v1",
-                    Contact = new OpenApiContact()
-                    {
-                        Name = "David Fowler",
-                        Url = new Uri("https://github.com/davidfowl"),
-                    },
-                    License = new OpenApiLicense()
-                    {
-                        Name = "MIT",
-                        Url = new Uri("http://opensource.org/licenses/MIT"),
-                    }
-                });
+                new OpenApiInfo
+{});
             options.DocumentFilter<TagDescriptionsDocumentFilter>();
             options.InferSecuritySchemes();

[Survived] Object initializer mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:37:31
                         Name = "David Fowler",
                         Url = new Uri("https://github.com/davidfowl"),
                     },
-                    License = new OpenApiLicense()
-                    {
-                        Name = "MIT",
-                        Url = new Uri("http://opensource.org/licenses/MIT"),
-                    }
+                    License = new OpenApiLicense()
+{}
                 });
             options.DocumentFilter<TagDescriptionsDocumentFilter>();

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:39:32
                     },
                     License = new OpenApiLicense()
                     {
-                        Name = "MIT",
+                        Name = "",
                         Url = new Uri("http://opensource.org/licenses/MIT"),
                     }

[Killed] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:40:39
                     License = new OpenApiLicense()
                     {
                         Name = "MIT",
-                        Url = new Uri("http://opensource.org/licenses/MIT"),
+                        Url = new Uri(""),
                     }
                 });
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:43:13
                         Url = new Uri("http://opensource.org/licenses/MIT"),
                     }
                 });
-            options.DocumentFilter<TagDescriptionsDocumentFilter>();
+            ;
             options.InferSecuritySchemes();
             options.SupportNonNullableReferenceTypes();

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:44:13
                     }
                 });
             options.DocumentFilter<TagDescriptionsDocumentFilter>();
-            options.InferSecuritySchemes();
+            ;
             options.SupportNonNullableReferenceTypes();
             options.EnableAnnotations();

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:45:13
                 });
             options.DocumentFilter<TagDescriptionsDocumentFilter>();
             options.InferSecuritySchemes();
-            options.SupportNonNullableReferenceTypes();
+            ;
             options.EnableAnnotations();
 

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:46:13
             options.DocumentFilter<TagDescriptionsDocumentFilter>();
             options.InferSecuritySchemes();
             options.SupportNonNullableReferenceTypes();
-            options.EnableAnnotations();
+            ;
 
             return options;

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:79:13
 
         public static RouteHandlerBuilder DescribeToken(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-             {
-                 o.Summary = "Authenticate user";
-                 o.Description = "Generate a valid token to authenticate Todos endpoints by username and password.";
-                 o.Responses["200"].Description = "Token generated successfully";
-                 o.Responses["400"].Description = "Invalid credentials";
-                 return o;
-             });
+            ;
 
             return builder;

[Killed] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:83:30
              {
                  o.Summary = "Authenticate user";
                  o.Description = "Generate a valid token to authenticate Todos endpoints by username and password.";
-                 o.Responses["200"].Description = "Token generated successfully";
+                 o.Responses[""].Description = "Token generated successfully";
                  o.Responses["400"].Description = "Invalid credentials";
                  return o;
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:83:51
              {
                  o.Summary = "Authenticate user";
                  o.Description = "Generate a valid token to authenticate Todos endpoints by username and password.";
-                 o.Responses["200"].Description = "Token generated successfully";
+                 o.Responses["200"].Description = "";
                  o.Responses["400"].Description = "Invalid credentials";
                  return o;

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:93:13
 
         public static RouteHandlerBuilder DescribeCreateUser(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-            {
-                o.Summary = "Create an user";
-                o.Description = "This endpoint creates new user with an username and password.";
-                o.Responses["200"].Description = "User created successfully";
-                o.Responses["400"].Description = "Invalid fields or user already exists";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:97:50
             {
                 o.Summary = "Create an user";
                 o.Description = "This endpoint creates new user with an username and password.";
-                o.Responses["200"].Description = "User created successfully";
+                o.Responses["200"].Description = "";
                 o.Responses["400"].Description = "Invalid fields or user already exists";
                 return o;

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:107:13
 
         public static RouteHandlerBuilder DescribeCreateTodo(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-            {
-                o.Summary = "Create a todo";
-                o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
-                o.Responses["201"].Description = "Todo created successfully";
-                o.Responses["400"].Description = "Invalid title";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:111:50
             {
                 o.Summary = "Create a todo";
                 o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
-                o.Responses["201"].Description = "Todo created successfully";
+                o.Responses["201"].Description = "";
                 o.Responses["400"].Description = "Invalid title";
                 return o;

[Survived] Boolean mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:126:51
                 o.Summary = "Update a todo";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
-                o.Parameters[0].AllowEmptyValue = false;
+                o.Parameters[0].AllowEmptyValue = true;
                 o.Responses["200"].Description = "Todo updated successfully";
                 o.Responses["400"].Description = "Invalid title or missing isComplete";

[Killed] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:127:29
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo updated successfully";
+                o.Responses[""].Description = "Todo updated successfully";
                 o.Responses["400"].Description = "Invalid title or missing isComplete";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:127:50
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo updated successfully";
+                o.Responses["200"].Description = "";
                 o.Responses["400"].Description = "Invalid title or missing isComplete";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";

[Killed] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:128:29
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo updated successfully";
-                o.Responses["400"].Description = "Invalid title or missing isComplete";
+                o.Responses[""].Description = "Invalid title or missing isComplete";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
                 return o;
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:138:13
 
         public static RouteHandlerBuilder DescribeDeleteTodo(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-            {
-                o.Summary = "Delete a todo";
-                o.Description = "This endpoint deletes an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
-                o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo deleted successfully";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:154:13
 
         public static RouteHandlerBuilder DescribeListTodos(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-            {
-                o.Summary = "List all todos";
-                o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
-                o.Responses["200"].Description = "Todos listed successfully";
-                return o;
-            });
+            ;
 
             return builder;

[Timeout] Statement mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:167:13
 
         public static RouteHandlerBuilder DescribeGetTodo(this RouteHandlerBuilder builder)
         {
-            builder.WithOpenApi(o =>
-            {
-                o.Summary = "Get a todo";
-                o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
-                o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo consulted successfully";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:170:33
             builder.WithOpenApi(o =>
             {
                 o.Summary = "Get a todo";
-                o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
+                o.Description = "";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;

[Survived] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:171:47
             {
                 o.Summary = "Get a todo";
                 o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
+                o.Parameters[0].Description = "";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo consulted successfully";

[Killed] String mutation
TodoApi/TodoApi/Extensions/DescribeSwaggerExtensions.cs:173:29
                 o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo consulted successfully";
+                o.Responses[""].Description = "Todo consulted successfully";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
                 return o;
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser
