[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:59:9
         })
         .DescribeCreateTodo();
 
-        group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
-        {
-            var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id)
-            {
-                var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
-                                             .ExecuteUpdateAsync(updates =>
-                                                updates.SetProperty(t => t.IsComplete, todo.IsComplete)
-                                                       .SetProperty(t => t.Title, todo.Title));
-
-                return TypedResults.Ok(todo.AsTodoItemResponse(id));
-            }
-            else
-            {
-                return TypedResults.NotFound();
-            }
-        })
-        .DescribeUpdateTodo();
+        ;
 
         group.MapDelete("/{id}", async Task<Results<Ok, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:62:17
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
         {
             var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id)
+            if (currentTodo == null && currentTodo.OwnerId == owner.Id)
             {
                 var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:62:40
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
         {
             var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id)
+            if (currentTodo != null && currentTodo.OwnerId != owner.Id)
             {
                 var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos
