[NoCoverage] String mutation
TodoApi/TodoApi/Authentication/TokenService.cs:41:87
 
         var section = bearerSection.GetSection("SigningKeys:0");
 
-        _issuer = bearerSection["ValidIssuer"] ?? throw new InvalidOperationException("Issuer is not specified");
+        _issuer = bearerSection["ValidIssuer"] ?? throw new InvalidOperationException("");
         var signingKeyBase64 = section["Value"] ?? throw new InvalidOperationException("Signing key is not specified");
 

[Killed] String mutation
TodoApi/TodoApi/Authentication/TokenService.cs:42:40
         var section = bearerSection.GetSection("SigningKeys:0");
 
         _issuer = bearerSection["ValidIssuer"] ?? throw new InvalidOperationException("Issuer is not specified");
-        var signingKeyBase64 = section["Value"] ?? throw new InvalidOperationException("Signing key is not specified");
+        var signingKeyBase64 = section[""] ?? throw new InvalidOperationException("Signing key is not specified");
 
         var signingKeyBytes = Convert.FromBase64String(signingKeyBase64);
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
TodoApi/TodoApi/Authentication/TokenService.cs:50:33
                 SecurityAlgorithms.HmacSha256Signature);
 
         _audiences = bearerSection.GetSection("ValidAudiences").GetChildren()
-                    .Where(s => !string.IsNullOrEmpty(s.Value))
+                    .Where(s => string.IsNullOrEmpty(s.Value))
                     .Select(s => new Claim(JwtRegisteredClaimNames.Aud, s.Value!))
                     .ToArray();
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Killed] Statement mutation
TodoApi/TodoApi/Authentication/TokenService.cs:59:9
     {
         var identity = new ClaimsIdentity(JwtBearerDefaults.AuthenticationScheme);
 
-        identity.AddClaim(new Claim(JwtRegisteredClaimNames.Sub, username));
+        ;
 
         // REVIEW: Check that this logic is OK for jti claims
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] Statement mutation
TodoApi/TodoApi/Authentication/TokenService.cs:64:9
         // REVIEW: Check that this logic is OK for jti claims
         var id = Guid.NewGuid().ToString().GetHashCode().ToString("x", CultureInfo.InvariantCulture);
 
-        identity.AddClaim(new Claim(JwtRegisteredClaimNames.Jti, id));
+        ;
 
         if (isAdmin)

[Survived] Negate expression
TodoApi/TodoApi/Authentication/TokenService.cs:66:13
 
         identity.AddClaim(new Claim(JwtRegisteredClaimNames.Jti, id));
 
-        if (isAdmin)
+        if (!(isAdmin))
         {
             identity.AddClaim(new Claim(ClaimTypes.Role, "admin"));

[NoCoverage] Statement mutation
TodoApi/TodoApi/Authentication/TokenService.cs:68:13
 
         if (isAdmin)
         {
-            identity.AddClaim(new Claim(ClaimTypes.Role, "admin"));
+            ;
         }
 

[Killed] Statement mutation
TodoApi/TodoApi/Authentication/TokenService.cs:71:9
             identity.AddClaim(new Claim(ClaimTypes.Role, "admin"));
         }
 
-        identity.AddClaims(_audiences);
+        ;
 
         var handler = new JwtSecurityTokenHandler();
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos
