[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:27:13
         var resourceBuilder = ResourceBuilder.CreateDefault().AddService(builder.Environment.ApplicationName);
         var otlpEndpoint = builder.Configuration["OTEL_EXPORTER_OTLP_ENDPOINT"];
 
-        if (!string.IsNullOrWhiteSpace(otlpEndpoint))
+        if (string.IsNullOrWhiteSpace(otlpEndpoint))
         {
             builder.Logging.AddOpenTelemetry(logging =>

[Killed] String mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:27:14
         var resourceBuilder = ResourceBuilder.CreateDefault().AddService(builder.Environment.ApplicationName);
         var otlpEndpoint = builder.Configuration["OTEL_EXPORTER_OTLP_ENDPOINT"];
 
-        if (!string.IsNullOrWhiteSpace(otlpEndpoint))
+        if (!(otlpEndpoint.Trim()!=""))
         {
             builder.Logging.AddOpenTelemetry(logging =>
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[NoCoverage] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:29:13
 
         if (!string.IsNullOrWhiteSpace(otlpEndpoint))
         {
-            builder.Logging.AddOpenTelemetry(logging =>
-            {
-                logging.SetResourceBuilder(resourceBuilder)
-                       .AddOtlpExporter();
-            });
+            ;
         }
 

[NoCoverage] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:31:17
         {
             builder.Logging.AddOpenTelemetry(logging =>
             {
-                logging.SetResourceBuilder(resourceBuilder)
-                       .AddOtlpExporter();
+                ;
             });
         }

[Killed] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:39:17
         builder.Services.AddOpenTelemetry()
             .WithMetrics(metrics =>
             {
-                metrics.SetResourceBuilder(resourceBuilder)
-                       .AddPrometheusExporter()
-                       .AddAspNetCoreInstrumentation()
-                       .AddRuntimeInstrumentation()
-                       .AddHttpClientInstrumentation()
-                       .AddEventCountersInstrumentation(c =>
-                       {
-                           // https://learn.microsoft.com/en-us/dotnet/core/diagnostics/available-counters
-                           c.AddEventSources(
-                               "Microsoft.AspNetCore.Hosting",
-                               "Microsoft-AspNetCore-Server-Kestrel",
-                               "System.Net.Http",
-                               "System.Net.Sockets",
-                               "System.Net.NameResolution",
-                               "System.Net.Security");
-                       });
+                ;
             })
             .WithTracing(tracing =>
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:47:28
                        .AddEventCountersInstrumentation(c =>
                        {
                            // https://learn.microsoft.com/en-us/dotnet/core/diagnostics/available-counters
-                           c.AddEventSources(
-                               "Microsoft.AspNetCore.Hosting",
-                               "Microsoft-AspNetCore-Server-Kestrel",
-                               "System.Net.Http",
-                               "System.Net.Sockets",
-                               "System.Net.NameResolution",
-                               "System.Net.Security");
+                           ;
                        });
             })

[Survived] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:61:17
                 // We need to use AlwaysSampler to record spans
                 // from Todo.Web.Server, because there it no OpenTelemetry
                 // instrumentation
-                tracing.SetResourceBuilder(resourceBuilder)
-                       .SetSampler(new AlwaysOnSampler())
-                       .AddAspNetCoreInstrumentation()
-                       .AddHttpClientInstrumentation()
-                       .AddEntityFrameworkCoreInstrumentation();
+                ;
 
                 if (!string.IsNullOrWhiteSpace(otlpEndpoint))

[NoCoverage] Statement mutation
TodoApi/TodoApi/Extensions/OpenTelemetryExtensions.cs:69:21
 
                 if (!string.IsNullOrWhiteSpace(otlpEndpoint))
                 {
-                    tracing.AddOtlpExporter();
+                    ;
                 }
             })
