[Killed] Block removal mutation
TodoApi/TodoApi/Authorization/CheckCurrentUserAuthHandler.cs:9:5
 {
     // Adds the current user requirement that will activate our authorization handler
     public static AuthorizationPolicyBuilder RequireCurrentUser(this AuthorizationPolicyBuilder builder)
-    {
-        return builder.RequireAuthenticatedUser()
-                      .AddRequirements(new CheckCurrentUserRequirement());
-    }
+    {}
 
     public class CheckCurrentUserRequirement : IAuthorizationRequirement { }
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Authorization/CheckCurrentUserAuthHandler.cs:26:38
         protected override Task HandleRequirementAsync(AuthorizationHandlerContext context, CheckCurrentUserRequirement requirement)
         {
             // TODO: Check user if the user is locked out as well
-            if (_currentUser.User is not null)
+            if (_currentUser.User is null)
             {
                 context.Succeed(requirement);
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Killed] Statement mutation
TodoApi/TodoApi/Authorization/CheckCurrentUserAuthHandler.cs:28:17
             // TODO: Check user if the user is locked out as well
             if (_currentUser.User is not null)
             {
-                context.Succeed(requirement);
+                ;
             }
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser
