[Survived] String mutation
TodoApi/TodoApi/Extensions/RateLimitExtensions.cs:8:45
 
 public static class RateLimitExtensions
 {
-    private static readonly string Policy = "PerUserRatelimit";
+    private static readonly string Policy = "";
 
     public static IServiceCollection AddRateLimiting(this IServiceCollection services)

[Killed] Statement mutation
TodoApi/TodoApi/Extensions/RateLimitExtensions.cs:16:13
         {
             options.RejectionStatusCode = StatusCodes.Status429TooManyRequests;
 
-            options.AddPolicy(Policy, context =>
-            {
-                // We always have a user name
-                var username = context.User.FindFirstValue(ClaimTypes.NameIdentifier)!;
-
-                return RateLimitPartition.GetTokenBucketLimiter(username, key =>
-                {
-                    return new()
-                    {
-                        ReplenishmentPeriod = TimeSpan.FromSeconds(10),
-                        AutoReplenishment = true,
-                        TokenLimit = 100,
-                        TokensPerPeriod = 100,
-                        QueueLimit = 100,
-                    };
-                });
-            });
+            ;
         });
     }
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] Boolean mutation
TodoApi/TodoApi/Extensions/RateLimitExtensions.cs:26:45
                     return new()
                     {
                         ReplenishmentPeriod = TimeSpan.FromSeconds(10),
-                        AutoReplenishment = true,
+                        AutoReplenishment = false,
                         TokenLimit = 100,
                         TokensPerPeriod = 100,

[Survived] Block removal mutation
TodoApi/TodoApi/Extensions/RateLimitExtensions.cs:37:5
     }
 
     public static IEndpointConventionBuilder RequirePerUserRateLimit(this IEndpointConventionBuilder builder)
-    {
-        return builder.RequireRateLimiting(Policy);
-    }
+    {}
 }
 
