[Survived] Linq method mutation (FirstOrDefault() to First())
TodoApi/TodoApi/Filters/ValidationFilter.cs:13:30
     {
         builder.Add(eb =>
         {
-            var methodInfo = eb.Metadata.OfType<MethodInfo>().FirstOrDefault();
+            var methodInfo = eb.Metadata.OfType<MethodInfo>().First();
 
             if (methodInfo is null)

[Killed] Equality mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:15:31
         {
             var methodInfo = eb.Metadata.OfType<MethodInfo>().FirstOrDefault();
 
-            if (methodInfo is null)
+            if (methodInfo is not null)
             {
                 return;
killedBy: TodoApi.Tests.UserApiTests.MissingUserOrPasswordReturnsBadRequest

[Killed] Negate expression
TodoApi/TodoApi/Filters/ValidationFilter.cs:24:21
             List<int>? parameterIndexesToValidate = null;
             foreach (var p in methodInfo.GetParameters())
             {
-                if (typesToValidate.Contains(p.ParameterType))
+                if (!(typesToValidate.Contains(p.ParameterType)))
                 {
                     parameterIndexesToValidate ??= new();
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:26:21
             {
                 if (typesToValidate.Contains(p.ParameterType))
                 {
-                    parameterIndexesToValidate ??= new();
+                    parameterIndexesToValidate = new();
                     parameterIndexesToValidate.Add(p.Position);
                 }

[Killed] Statement mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:27:21
                 if (typesToValidate.Contains(p.ParameterType))
                 {
                     parameterIndexesToValidate ??= new();
-                    parameterIndexesToValidate.Add(p.Position);
+                    ;
                 }
             }
killedBy: TodoApi.Tests.UserApiTests.MissingUserOrPasswordReturnsBadRequest

[Killed] Equality mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:31:47
                 }
             }
 
-            if (parameterIndexesToValidate is null)
+            if (parameterIndexesToValidate is not null)
             {
                 // Nothing to validate so don't add the filter to this endpoint
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:34:17
             if (parameterIndexesToValidate is null)
             {
                 // Nothing to validate so don't add the filter to this endpoint
-                return;
+                ;
             }
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Survived] Statement mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:38:13
             }
 
             // We can respond with problem details if there's a validation error
-            eb.Metadata.Add(new ProducesResponseTypeMetadata(typeof(HttpValidationProblemDetails), 400, "application/problem+json"));
+            ;
 
             eb.FilterFactories.Add((context, next) =>

[Killed] Statement mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:40:13
             // We can respond with problem details if there's a validation error
             eb.Metadata.Add(new ProducesResponseTypeMetadata(typeof(HttpValidationProblemDetails), 400, "application/problem+json"));
 
-            eb.FilterFactories.Add((context, next) =>
-            {
-                return efic =>
-                {
-                    foreach (var index in parameterIndexesToValidate)
-                    {
-                        if (efic.Arguments[index] is { } arg && !MiniValidator.TryValidate(arg, out var errors))
-                        {
-                            return new ValueTask<object?>(Results.ValidationProblem(errors));
-                        }
-                    }
-
-                    return next(efic);
-                };
-            });
+            ;
         });
 
killedBy: TodoApi.Tests.UserApiTests.MissingUserOrPasswordReturnsBadRequest

[Killed] Block removal mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:47:25
                     foreach (var index in parameterIndexesToValidate)
                     {
                         if (efic.Arguments[index] is { } arg && !MiniValidator.TryValidate(arg, out var errors))
-                        {
-                            return new ValueTask<object?>(Results.ValidationProblem(errors));
-                        }
+                        {}
                     }
 
killedBy: TodoApi.Tests.TodoApiTests.PostingTodoWithoutTitleReturnsProblemDetails; TodoApi.Tests.UserApiTests.MissingUserOrPasswordReturnsBadRequest

[Killed] Block removal mutation
TodoApi/TodoApi/Filters/ValidationFilter.cs:64:9
     private sealed class ProducesResponseTypeMetadata : IProducesResponseTypeMetadata
     {
         public ProducesResponseTypeMetadata(Type type, int statusCode, string contentType)
-        {
-            Type = type;
-            StatusCode = statusCode;
-            ContentTypes = new[] { contentType };
-        }
+        {}
 
         public Type Type { get; }
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser
