[Killed] Block removal mutation
TodoApi/TodoApi/Authorization/CurrentUserExtensions.cs:15:9
         private readonly UserManager<TodoUser> _userManager;
 
         public ClaimsTransformation(CurrentUser currentUser, UserManager<TodoUser> userManager)
-        {
-            _currentUser = currentUser;
-            _userManager = userManager;
-        }
+        {}
 
         public async Task<ClaimsPrincipal> TransformAsync(ClaimsPrincipal principal)
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos
