[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:15:9
         var builder = WebApplication.CreateBuilder(args);
 
         // Configure auth
-        builder.Services.AddAuthentication().AddJwtBearer();
+        ;
         builder.Services.AddAuthorizationBuilder();
         builder.Services.AddScoped<IAuthorizationHandler, CheckCurrentUserAuthHandler>();
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:16:9
 
         // Configure auth
         builder.Services.AddAuthentication().AddJwtBearer();
-        builder.Services.AddAuthorizationBuilder();
+        ;
         builder.Services.AddScoped<IAuthorizationHandler, CheckCurrentUserAuthHandler>();
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:17:9
         // Configure auth
         builder.Services.AddAuthentication().AddJwtBearer();
         builder.Services.AddAuthorizationBuilder();
-        builder.Services.AddScoped<IAuthorizationHandler, CheckCurrentUserAuthHandler>();
+        ;
 
         // Add the service to generate JWT tokens
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:20:9
         builder.Services.AddScoped<IAuthorizationHandler, CheckCurrentUserAuthHandler>();
 
         // Add the service to generate JWT tokens
-        builder.Services.AddSingleton<ITokenService, TokenService>();
+        ;
 
         // Configure the database
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Timeout] Null coalescing mutation (remove right)
GIT/TodoApi/TodoApi/Program.cs:23:32
         builder.Services.AddSingleton<ITokenService, TokenService>();
 
         // Configure the database
-        var connectionString = builder.Configuration.GetConnectionString("Todos") ?? "Data Source=.db/Todos.db";
+        var connectionString = "Data Source=.db/Todos.db";
         builder.Services.AddSqlite<TodoDbContext>(connectionString);
 

[Survived] String mutation
GIT/TodoApi/TodoApi/Program.cs:23:74
         builder.Services.AddSingleton<ITokenService, TokenService>();
 
         // Configure the database
-        var connectionString = builder.Configuration.GetConnectionString("Todos") ?? "Data Source=.db/Todos.db";
+        var connectionString = builder.Configuration.GetConnectionString("") ?? "Data Source=.db/Todos.db";
         builder.Services.AddSqlite<TodoDbContext>(connectionString);
 

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:24:9
 
         // Configure the database
         var connectionString = builder.Configuration.GetConnectionString("Todos") ?? "Data Source=.db/Todos.db";
-        builder.Services.AddSqlite<TodoDbContext>(connectionString);
+        ;
 
         // Configure identity

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:27:9
         builder.Services.AddSqlite<TodoDbContext>(connectionString);
 
         // Configure identity
-        builder.Services.AddIdentityCore<TodoUser>()
-                        .AddEntityFrameworkStores<TodoDbContext>();
+        ;
 
         // State that represents the current user from the database *and* the request
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:31:9
                         .AddEntityFrameworkStores<TodoDbContext>();
 
         // State that represents the current user from the database *and* the request
-        builder.Services.AddScoped<CurrentUser>();
+        ;
         builder.Services.AddScoped<IClaimsTransformation, ClaimsTransformation>();
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:32:9
 
         // State that represents the current user from the database *and* the request
         builder.Services.AddScoped<CurrentUser>();
-        builder.Services.AddScoped<IClaimsTransformation, ClaimsTransformation>();
+        ;
 
         // Configure Open API
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:35:9
         builder.Services.AddScoped<IClaimsTransformation, ClaimsTransformation>();
 
         // Configure Open API
-        builder.Services.AddEndpointsApiExplorer();
+        ;
         builder.Services.AddSwaggerGen(o => {
             o.DescribeApi();
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:36:9
 
         // Configure Open API
         builder.Services.AddEndpointsApiExplorer();
-        builder.Services.AddSwaggerGen(o => {
-            o.DescribeApi();
-        });
+        ;
 
         // Configure rate limiting
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:37:13
         // Configure Open API
         builder.Services.AddEndpointsApiExplorer();
         builder.Services.AddSwaggerGen(o => {
-            o.DescribeApi();
+            ;
         });
 

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:41:9
         });
 
         // Configure rate limiting
-        builder.Services.AddRateLimiting();
+        ;
 
         // Configure OpenTelemetry
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:44:9
         builder.Services.AddRateLimiting();
 
         // Configure OpenTelemetry
-        builder.AddOpenTelemetry();
+        ;
 
         var app = builder.Build();
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] String mutation
GIT/TodoApi/TodoApi/Program.cs:53:81
             var services = scope.ServiceProvider;
             try
             {
-                var databasePath = Path.GetDirectoryName(connectionString.Split("=", 2)[1]);
+                var databasePath = Path.GetDirectoryName(connectionString.Split("", 2)[1]);
                 if (!Directory.Exists(databasePath))
                 {

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
GIT/TodoApi/TodoApi/Program.cs:54:21
             try
             {
                 var databasePath = Path.GetDirectoryName(connectionString.Split("=", 2)[1]);
-                if (!Directory.Exists(databasePath))
+                if (Directory.Exists(databasePath))
                 {
                     Directory.CreateDirectory(databasePath);

[NoCoverage] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:56:21
                 var databasePath = Path.GetDirectoryName(connectionString.Split("=", 2)[1]);
                 if (!Directory.Exists(databasePath))
                 {
-                    Directory.CreateDirectory(databasePath);
+                    ;
                 }
 

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:60:17
                 }
 
                 var context = services.GetRequiredService<TodoDbContext>();
-                context.Database.EnsureCreated();
+                ;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:65:17
             catch (Exception ex)
             {
                 var logger = services.GetRequiredService<ILogger<Program>>();
-                logger.LogError(ex, "Error to apply migrations");
+                ;
             }
         }

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:69:9
             }
         }
         
-        app.UseSwagger();
+        ;
         app.UseSwaggerUI();
 

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:72:9
         app.UseSwagger();
         app.UseSwaggerUI();
 
-        app.UseRateLimiter();
+        ;
 
         app.Map("/", () => Results.Redirect("/swagger"));

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:74:9
 
         app.UseRateLimiter();
 
-        app.Map("/", () => Results.Redirect("/swagger"));
+        ;
 
         // Configure the APIs

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:77:9
         app.Map("/", () => Results.Redirect("/swagger"));
 
         // Configure the APIs
-        app.MapTodos();
+        ;
         app.MapUsers();
 
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:78:9
 
         // Configure the APIs
         app.MapTodos();
-        app.MapUsers();
+        ;
 
         // Configure the prometheus endpoint for scraping metrics
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] Statement mutation
GIT/TodoApi/TodoApi/Program.cs:81:9
         app.MapUsers();
 
         // Configure the prometheus endpoint for scraping metrics
-        app.MapPrometheusScrapingEndpoint();
+        ;
         // NOTE: This should only be exposed on an internal port!
         // .RequireHost("*:9100");
