[Survived] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:15:9
     {
         var group = routes.MapGroup("/todos");
 
-        group.WithTags("Todos");
+        ;
 
         group.RequireAuthorization(pb => pb.RequireCurrentUser())

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:17:9
 
         group.WithTags("Todos");
 
-        group.RequireAuthorization(pb => pb.RequireCurrentUser())
-             .DescribeApiSecurityRequirement();
+        ;
 
         group.RequirePerUserRateLimit();
killedBy: TodoApi.Tests.TodoApiTests.GetTodosWithoutDbUser

[Survived] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:20:9
         group.RequireAuthorization(pb => pb.RequireCurrentUser())
              .DescribeApiSecurityRequirement();
 
-        group.RequirePerUserRateLimit();
+        ;
 
         group.WithParameterValidation(typeof(CreateTodoRequest), typeof(UpdateTodoRequest));

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:22:9
 
         group.RequirePerUserRateLimit();
 
-        group.WithParameterValidation(typeof(CreateTodoRequest), typeof(UpdateTodoRequest));
+        ;
 
         group.MapGet("/", async (TodoDbContext db, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.PostingTodoWithoutTitleReturnsProblemDetails

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:24:9
 
         group.WithParameterValidation(typeof(CreateTodoRequest), typeof(UpdateTodoRequest));
 
-        group.MapGet("/", async (TodoDbContext db, CurrentUser owner) =>
-        {
-            return await db.Todos.Where(todo => todo.OwnerId == owner.Id)
-            .Select(t => t.AsTodoItemResponse())
-            .AsNoTracking()
-            .ToListAsync();
-        })
-        .DescribeListTodos();
+        ;
 
         group.MapGet("/{id}", async Task<Results<Ok<TodoResponse>, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] String mutation
TodoApi/TodoApi/Todos/TodoApi.cs:24:22
 
         group.WithParameterValidation(typeof(CreateTodoRequest), typeof(UpdateTodoRequest));
 
-        group.MapGet("/", async (TodoDbContext db, CurrentUser owner) =>
+        group.MapGet("", async (TodoDbContext db, CurrentUser owner) =>
         {
             return await db.Todos.Where(todo => todo.OwnerId == owner.Id)

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:26:49
 
         group.MapGet("/", async (TodoDbContext db, CurrentUser owner) =>
         {
-            return await db.Todos.Where(todo => todo.OwnerId == owner.Id)
+            return await db.Todos.Where(todo => todo.OwnerId != owner.Id)
             .Select(t => t.AsTodoItemResponse())
             .AsNoTracking()
killedBy: TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos; TodoApi.Tests.TodoApiTests.GetTodos

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:33:9
         })
         .DescribeListTodos();
 
-        group.MapGet("/{id}", async Task<Results<Ok<TodoResponse>, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
-        {
-            return await db.Todos.FindAsync(id) switch
-            {
-                Todo todo when todo != null && todo.OwnerId == owner.Id
-                              => TypedResults.Ok(todo.AsTodoItemResponse()),
-                            _ => TypedResults.NotFound()
-            };
-        })
-        .DescribeGetTodo();
+        ;
 
         group.MapPost("/", async Task<Results<Created<TodoResponse>, BadRequest<BadRequestResponse>>> (TodoDbContext db, CreateTodoRequest newTodo, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.CanOnlyGetTodosPostedBySameUser

[Killed] String mutation
TodoApi/TodoApi/Todos/TodoApi.cs:33:22
         })
         .DescribeListTodos();
 
-        group.MapGet("/{id}", async Task<Results<Ok<TodoResponse>, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
+        group.MapGet("", async Task<Results<Ok<TodoResponse>, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
         {
             return await db.Todos.FindAsync(id) switch
killedBy: TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:37:48
         {
             return await db.Todos.FindAsync(id) switch
             {
-                Todo todo when todo != null && todo.OwnerId == owner.Id
+                Todo todo when todo != null && todo.OwnerId != owner.Id
                               => TypedResults.Ok(todo.AsTodoItemResponse()),
                             _ => TypedResults.NotFound()
killedBy: TodoApi.Tests.TodoApiTests.CanOnlyGetTodosPostedBySameUser

[Killed] Logical mutation
TodoApi/TodoApi/Todos/TodoApi.cs:37:32
         {
             return await db.Todos.FindAsync(id) switch
             {
-                Todo todo when todo != null && todo.OwnerId == owner.Id
+                Todo todo when todo != null || todo.OwnerId == owner.Id
                               => TypedResults.Ok(todo.AsTodoItemResponse()),
                             _ => TypedResults.NotFound()
killedBy: TodoApi.Tests.TodoApiTests.CanOnlyGetTodosPostedBySameUser

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:44:9
         })
         .DescribeGetTodo();
 
-        group.MapPost("/", async Task<Results<Created<TodoResponse>, BadRequest<BadRequestResponse>>> (TodoDbContext db, CreateTodoRequest newTodo, CurrentUser owner) =>
-        {
-            var todo = new Todo
-            {
-                Title = newTodo.Title,
-                OwnerId = owner.Id
-            };
-
-            db.Todos.Add(todo);
-            await db.SaveChangesAsync();
-            
-            return TypedResults.Created($"/todos/{todo.Id}", newTodo.AsTodoItemResponse(todo.Id));
-        })
-        .DescribeCreateTodo();
+        ;
 
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.PostingTodoWithoutTitleReturnsProblemDetails

[Survived] String mutation
TodoApi/TodoApi/Todos/TodoApi.cs:44:23
         })
         .DescribeGetTodo();
 
-        group.MapPost("/", async Task<Results<Created<TodoResponse>, BadRequest<BadRequestResponse>>> (TodoDbContext db, CreateTodoRequest newTodo, CurrentUser owner) =>
+        group.MapPost("", async Task<Results<Created<TodoResponse>, BadRequest<BadRequestResponse>>> (TodoDbContext db, CreateTodoRequest newTodo, CurrentUser owner) =>
         {
             var todo = new Todo

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:52:13
                 OwnerId = owner.Id
             };
 
-            db.Todos.Add(todo);
+            ;
             await db.SaveChangesAsync();
             
killedBy: TodoApi.Tests.TodoApiTests.PostTodos

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:53:13
             };
 
             db.Todos.Add(todo);
-            await db.SaveChangesAsync();
+            ;
             
             return TypedResults.Created($"/todos/{todo.Id}", newTodo.AsTodoItemResponse(todo.Id));
killedBy: TodoApi.Tests.TodoApiTests.PostTodos

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:59:9
         })
         .DescribeCreateTodo();
 
-        group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
-        {
-            var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
-            {
-                var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
-                                             .ExecuteUpdateAsync(updates =>
-                                                updates.SetProperty(t => t.IsComplete, todo.IsComplete)
-                                                       .SetProperty(t => t.Title, todo.Title));
-
-                return TypedResults.Ok(todo.AsTodoItemResponse(id));
-            }
-            else
-            {
-                return TypedResults.NotFound();
-            }
-        })
-        .DescribeUpdateTodo();
+        ;
 
         group.MapDelete("/{id}", async Task<Results<Ok, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Logical mutation
TodoApi/TodoApi/Todos/TodoApi.cs:62:17
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
         {
             var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
+            if (currentTodo != null && currentTodo.OwnerId == owner.Id && owner.IsAdmin)
             {
                 var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:62:17
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
         {
             var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
+            if (currentTodo == null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
             {
                 var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:64:62
             var currentTodo = await db.Todos.FindAsync(id);
             if (currentTodo != null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
             {
-                var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
+                var rowsAffected = await db.Todos.Where(t => t.Id != id && t.OwnerId == owner.Id)
                                              .ExecuteUpdateAsync(updates =>
                                                 updates.SetProperty(t => t.IsComplete, todo.IsComplete)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:64:76
             var currentTodo = await db.Todos.FindAsync(id);
             if (currentTodo != null && currentTodo.OwnerId == owner.Id || owner.IsAdmin)
             {
-                var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
+                var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId != owner.Id)
                                              .ExecuteUpdateAsync(updates =>
                                                 updates.SetProperty(t => t.IsComplete, todo.IsComplete)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[NoCoverage] Block removal mutation
TodoApi/TodoApi/Todos/TodoApi.cs:72:13
                 return TypedResults.Ok(todo.AsTodoItemResponse(id));
             }
             else
-            {
-                return TypedResults.NotFound();
-            }
+            {}
         })
         .DescribeUpdateTodo();

[Killed] Statement mutation
TodoApi/TodoApi/Todos/TodoApi.cs:78:9
         })
         .DescribeUpdateTodo();
 
-        group.MapDelete("/{id}", async Task<Results<Ok, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
-        {
-            var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
-                                             .ExecuteDeleteAsync();
-
-            return rowsAffected == 0 ? TypedResults.NotFound() : TypedResults.Ok();
-        })
-        .DescribeDeleteTodo(); ;
+        ; ;
 
         return group;
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos

[Killed] Logical mutation
TodoApi/TodoApi/Todos/TodoApi.cs:80:58
 
         group.MapDelete("/{id}", async Task<Results<Ok, NotFound>> (TodoDbContext db, int id, CurrentUser owner) =>
         {
-            var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
+            var rowsAffected = await db.Todos.Where(t => t.Id == id || t.OwnerId == owner.Id)
                                              .ExecuteDeleteAsync();
 
killedBy: TodoApi.Tests.TodoApiTests.CannotDeleteUnownedTodos

[Killed] Equality mutation
TodoApi/TodoApi/Todos/TodoApi.cs:83:20
             var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
                                              .ExecuteDeleteAsync();
 
-            return rowsAffected == 0 ? TypedResults.NotFound() : TypedResults.Ok();
+            return rowsAffected != 0 ? TypedResults.NotFound() : TypedResults.Ok();
         })
         .DescribeDeleteTodo(); ;
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos; TodoApi.Tests.TodoApiTests.CannotDeleteUnownedTodos

[Killed] Conditional (true) mutation
TodoApi/TodoApi/Todos/TodoApi.cs:83:20
             var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
                                              .ExecuteDeleteAsync();
 
-            return rowsAffected == 0 ? TypedResults.NotFound() : TypedResults.Ok();
+            return (true?TypedResults.NotFound() :TypedResults.Ok());
         })
         .DescribeDeleteTodo(); ;
killedBy: TodoApi.Tests.TodoApiTests.DeleteTodos
