[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:97:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "AspNetUserLogins",
-                columns: table => new
-                {
-                    LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
-                    UserId = table.Column<string>(type: "TEXT", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserLogins_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:101:82
                 name: "AspNetUserLogins",
                 columns: table => new
                 {
-                    LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
+                    LoginProvider = table.Column<string>(type: "TEXT", nullable: true),
                     ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:102:80
                 columns: table => new
                 {
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
+                    ProviderKey = table.Column<string>(type: "TEXT", nullable: true),
                     ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
                     UserId = table.Column<string>(type: "TEXT", nullable: false)

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:103:88
                 {
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
+                    ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: false),
                     UserId = table.Column<string>(type: "TEXT", nullable: false)
                 },

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:103:70
                 {
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
+                    ProviderDisplayName = table.Column<string>(type: "", nullable: true),
                     UserId = table.Column<string>(type: "TEXT", nullable: false)
                 },

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:104:75
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
-                    UserId = table.Column<string>(type: "TEXT", nullable: false)
+                    UserId = table.Column<string>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:104:57
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
-                    UserId = table.Column<string>(type: "TEXT", nullable: false)
+                    UserId = table.Column<string>(type: "", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:108:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
+                    ;
                     table.ForeignKey(
                         name: "FK_AspNetUserLogins_AspNetUsers_UserId",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:109:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserLogins_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:117:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "AspNetUserRoles",
-                columns: table => new
-                {
-                    UserId = table.Column<string>(type: "TEXT", nullable: false),
-                    RoleId = table.Column<string>(type: "TEXT", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_AspNetUserRoles", x => new { x.UserId, x.RoleId });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserRoles_AspNetRoles_RoleId",
-                        column: x => x.RoleId,
-                        principalTable: "AspNetRoles",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_AspNetUserRoles_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:121:75
                 name: "AspNetUserRoles",
                 columns: table => new
                 {
-                    UserId = table.Column<string>(type: "TEXT", nullable: false),
+                    UserId = table.Column<string>(type: "TEXT", nullable: true),
                     RoleId = table.Column<string>(type: "TEXT", nullable: false)
                 },

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:122:75
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "TEXT", nullable: false),
-                    RoleId = table.Column<string>(type: "TEXT", nullable: false)
+                    RoleId = table.Column<string>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:126:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_AspNetUserRoles", x => new { x.UserId, x.RoleId });
+                    ;
                     table.ForeignKey(
                         name: "FK_AspNetUserRoles_AspNetRoles_RoleId",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:127:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_AspNetUserRoles", x => new { x.UserId, x.RoleId });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserRoles_AspNetRoles_RoleId",
-                        column: x => x.RoleId,
-                        principalTable: "AspNetRoles",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                     table.ForeignKey(
                         name: "FK_AspNetUserRoles_AspNetUsers_UserId",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:133:21
                         principalTable: "AspNetRoles",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_AspNetUserRoles_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:137:42
                         name: "FK_AspNetUserRoles_AspNetUsers_UserId",
                         column: x => x.UserId,
                         principalTable: "AspNetUsers",
-                        principalColumn: "Id",
+                        principalColumn: "",
                         onDelete: ReferentialAction.Cascade);
                 });

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:141:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "AspNetUserTokens",
-                columns: table => new
-                {
-                    UserId = table.Column<string>(type: "TEXT", nullable: false),
-                    LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
-                    Name = table.Column<string>(type: "TEXT", nullable: false),
-                    Value = table.Column<string>(type: "TEXT", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserTokens_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:146:82
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "TEXT", nullable: false),
-                    LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
+                    LoginProvider = table.Column<string>(type: "TEXT", nullable: true),
                     Name = table.Column<string>(type: "TEXT", nullable: false),
                     Value = table.Column<string>(type: "TEXT", nullable: true)

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:147:73
                 {
                     UserId = table.Column<string>(type: "TEXT", nullable: false),
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
-                    Name = table.Column<string>(type: "TEXT", nullable: false),
+                    Name = table.Column<string>(type: "TEXT", nullable: true),
                     Value = table.Column<string>(type: "TEXT", nullable: true)
                 },

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:148:74
                     UserId = table.Column<string>(type: "TEXT", nullable: false),
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
                     Name = table.Column<string>(type: "TEXT", nullable: false),
-                    Value = table.Column<string>(type: "TEXT", nullable: true)
+                    Value = table.Column<string>(type: "TEXT", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:152:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
+                    ;
                     table.ForeignKey(
                         name: "FK_AspNetUserTokens_AspNetUsers_UserId",

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:152:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
+                    table.PrimaryKey("", x => new { x.UserId, x.LoginProvider, x.Name });
                     table.ForeignKey(
                         name: "FK_AspNetUserTokens_AspNetUsers_UserId",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:153:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
-                    table.ForeignKey(
-                        name: "FK_AspNetUserTokens_AspNetUsers_UserId",
-                        column: x => x.UserId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:154:31
                 {
                     table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
                     table.ForeignKey(
-                        name: "FK_AspNetUserTokens_AspNetUsers_UserId",
+                        name: "",
                         column: x => x.UserId,
                         principalTable: "AspNetUsers",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:161:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Todos",
-                columns: table => new
-                {
-                    Id = table.Column<int>(type: "INTEGER", nullable: false)
-                        .Annotation("Sqlite:Autoincrement", true),
-                    Title = table.Column<string>(type: "TEXT", nullable: false),
-                    IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
-                    OwnerId = table.Column<string>(type: "TEXT", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Todos", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_Todos_AspNetUsers_OwnerId",
-                        column: x => x.OwnerId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "UserName",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:162:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "Todos",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:167:74
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
-                    Title = table.Column<string>(type: "TEXT", nullable: false),
+                    Title = table.Column<string>(type: "TEXT", nullable: true),
                     IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
                     OwnerId = table.Column<string>(type: "TEXT", nullable: false)

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:168:80
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
                     Title = table.Column<string>(type: "TEXT", nullable: false),
-                    IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
+                    IsComplete = table.Column<bool>(type: "INTEGER", nullable: true),
                     OwnerId = table.Column<string>(type: "TEXT", nullable: false)
                 },

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:169:76
                         .Annotation("Sqlite:Autoincrement", true),
                     Title = table.Column<string>(type: "TEXT", nullable: false),
                     IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
-                    OwnerId = table.Column<string>(type: "TEXT", nullable: false)
+                    OwnerId = table.Column<string>(type: "TEXT", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:173:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Todos", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_Todos_AspNetUsers_OwnerId",

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:174:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_Todos", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_Todos_AspNetUsers_OwnerId",
-                        column: x => x.OwnerId,
-                        principalTable: "AspNetUsers",
-                        principalColumn: "UserName",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:178:42
                         name: "FK_Todos_AspNetUsers_OwnerId",
                         column: x => x.OwnerId,
                         principalTable: "AspNetUsers",
-                        principalColumn: "UserName",
+                        principalColumn: "",
                         onDelete: ReferentialAction.Cascade);
                 });

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:182:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateIndex(
-                name: "IX_AspNetRoleClaims_RoleId",
-                table: "AspNetRoleClaims",
-                column: "RoleId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:183:23
                 });
 
             migrationBuilder.CreateIndex(
-                name: "IX_AspNetRoleClaims_RoleId",
+                name: "",
                 table: "AspNetRoleClaims",
                 column: "RoleId");

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:187:13
                 table: "AspNetRoleClaims",
                 column: "RoleId");
 
-            migrationBuilder.CreateIndex(
-                name: "RoleNameIndex",
-                table: "AspNetRoles",
-                column: "NormalizedName",
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:191:25
                 name: "RoleNameIndex",
                 table: "AspNetRoles",
                 column: "NormalizedName",
-                unique: true);
+                unique: false);
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:193:13
                 column: "NormalizedName",
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserClaims_UserId",
-                table: "AspNetUserClaims",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:198:13
                 table: "AspNetUserClaims",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserLogins_UserId",
-                table: "AspNetUserLogins",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:203:13
                 table: "AspNetUserLogins",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserRoles_RoleId",
-                table: "AspNetUserRoles",
-                column: "RoleId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:205:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetUserRoles_RoleId",
-                table: "AspNetUserRoles",
+                table: "",
                 column: "RoleId");
 

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:208:13
                 table: "AspNetUserRoles",
                 column: "RoleId");
 
-            migrationBuilder.CreateIndex(
-                name: "EmailIndex",
-                table: "AspNetUsers",
-                column: "NormalizedEmail");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:209:23
                 column: "RoleId");
 
             migrationBuilder.CreateIndex(
-                name: "EmailIndex",
+                name: "",
                 table: "AspNetUsers",
                 column: "NormalizedEmail");

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:213:13
                 table: "AspNetUsers",
                 column: "NormalizedEmail");
 
-            migrationBuilder.CreateIndex(
-                name: "UserNameIndex",
-                table: "AspNetUsers",
-                column: "NormalizedUserName",
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:217:25
                 name: "UserNameIndex",
                 table: "AspNetUsers",
                 column: "NormalizedUserName",
-                unique: true);
+                unique: false);
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:219:13
                 column: "NormalizedUserName",
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Todos_OwnerId",
-                table: "Todos",
-                column: "OwnerId");
+            ;
         }
 

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:222:25
             migrationBuilder.CreateIndex(
                 name: "IX_Todos_OwnerId",
                 table: "Todos",
-                column: "OwnerId");
+                column: "");
         }
 

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:228:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "AspNetRoleClaims");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:231:13
             migrationBuilder.DropTable(
                 name: "AspNetRoleClaims");
 
-            migrationBuilder.DropTable(
-                name: "AspNetUserClaims");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:234:13
             migrationBuilder.DropTable(
                 name: "AspNetUserClaims");
 
-            migrationBuilder.DropTable(
-                name: "AspNetUserLogins");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:237:13
             migrationBuilder.DropTable(
                 name: "AspNetUserLogins");
 
-            migrationBuilder.DropTable(
-                name: "AspNetUserRoles");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:238:23
                 name: "AspNetUserLogins");
 
             migrationBuilder.DropTable(
-                name: "AspNetUserRoles");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:240:13
             migrationBuilder.DropTable(
                 name: "AspNetUserRoles");
 
-            migrationBuilder.DropTable(
-                name: "AspNetUserTokens");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:241:23
                 name: "AspNetUserRoles");
 
             migrationBuilder.DropTable(
-                name: "AspNetUserTokens");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:243:13
             migrationBuilder.DropTable(
                 name: "AspNetUserTokens");
 
-            migrationBuilder.DropTable(
-                name: "Todos");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:246:13
             migrationBuilder.DropTable(
                 name: "Todos");
 
-            migrationBuilder.DropTable(
-                name: "AspNetRoles");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:247:23
                 name: "Todos");
 
             migrationBuilder.DropTable(
-                name: "AspNetRoles");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:249:13
             migrationBuilder.DropTable(
                 name: "AspNetRoles");
 
-            migrationBuilder.DropTable(
-                name: "AspNetUsers");
+            ;
         }
     }

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123071234_Initial.cs:250:23
                 name: "AspNetRoles");
 
             migrationBuilder.DropTable(
-                name: "AspNetUsers");
+                name: "");
         }
     }
