[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:13:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropColumn(
-                name: "IsAdmin",
-                table: "AspNetUsers");
+            ;
         }
 

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:15:24
         {
             migrationBuilder.DropColumn(
                 name: "IsAdmin",
-                table: "AspNetUsers");
+                table: "");
         }
 

[NoCoverage] Statement mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:21:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AddColumn<bool>(
-                name: "IsAdmin",
-                table: "AspNetUsers",
-                type: "INTEGER",
-                nullable: false,
-                defaultValue: false);
+            ;
         }
     }

[NoCoverage] String mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:22:23
         protected override void Down(MigrationBuilder migrationBuilder)
         {
             migrationBuilder.AddColumn<bool>(
-                name: "IsAdmin",
+                name: "",
                 table: "AspNetUsers",
                 type: "INTEGER",

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:25:27
                 name: "IsAdmin",
                 table: "AspNetUsers",
                 type: "INTEGER",
-                nullable: false,
+                nullable: true,
                 defaultValue: false);
         }

[NoCoverage] Boolean mutation
TodoApi/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:26:31
                 table: "AspNetUsers",
                 type: "INTEGER",
                 nullable: false,
-                defaultValue: false);
+                defaultValue: true);
         }
     }
