[Killed] Block removal mutation
TodoApi/TodoApi/Users/TokenResponse.cs:11:5
     public TokenResponse() { }
 
     public TokenResponse(string token) 
-    { 
-        Token = token;
-    }
+    {}
 
     [DefaultValue("eyJhbGc...")]
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser
