[Survived] Statement mutation
GIT/TodoApi/TodoApi/TodoDbContext.cs:14:9
 
     protected override void OnModelCreating(ModelBuilder builder)
     {
-        builder.Entity<Todo>()
-               .HasOne<TodoUser>()
-               .WithMany()
-               .HasForeignKey(t => t.OwnerId)
-               .HasPrincipalKey(u => u.UserName);
+        ;
 
         base.OnModelCreating(builder);

[Survived] Statement mutation
GIT/TodoApi/TodoApi/TodoDbContext.cs:20:9
                .HasForeignKey(t => t.OwnerId)
                .HasPrincipalKey(u => u.UserName);
 
-        base.OnModelCreating(builder);
+        ;
     }
 }
