[Killed] Object initializer mutation
TodoApi/TodoApi/Todos/TodoMappingExtensions.cs:8:16
 {
     public static TodoResponse AsTodoItemResponse(this Todo todo)
     {
-        return new TodoResponse()
-        {
-            Id = todo.Id,
-            Title = todo.Title,
-            IsComplete = todo.IsComplete,
-        };
+        return new TodoResponse()
+{};
     }
 
killedBy: TodoApi.Tests.TodoApiTests.PostTodos; TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos; TodoApi.Tests.TodoApiTests.GetTodos

[Survived] Object initializer mutation
TodoApi/TodoApi/Todos/TodoMappingExtensions.cs:18:16
 
     public static TodoResponse AsTodoItemResponse(this UpdateTodoRequest todo, int id)
     {
-        return new TodoResponse()
-        {
-            Id = id,
-            Title = todo.Title,
-            IsComplete = todo.IsComplete.Value,
-        };
+        return new TodoResponse()
+{};
     }
 

[Survived] Boolean mutation
TodoApi/TodoApi/Todos/TodoMappingExtensions.cs:32:26
         {
             Id = id,
             Title = todo.Title,
-            IsComplete = false
+            IsComplete = true
         };
     }
