[Killed] String mutation
TodoApi/TodoApi/Users/UsersApi.cs:13:37
 {
     public static RouteGroupBuilder MapUsers(this IEndpointRouteBuilder routes)
     {
-        var group = routes.MapGroup("/users");
+        var group = routes.MapGroup("");
 
         group.WithTags("Users");
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:15:9
     {
         var group = routes.MapGroup("/users");
 
-        group.WithTags("Users");
+        ;
 
         group.WithParameterValidation(typeof(CreateUserRequest));

[Survived] String mutation
TodoApi/TodoApi/Users/UsersApi.cs:15:24
     {
         var group = routes.MapGroup("/users");
 
-        group.WithTags("Users");
+        group.WithTags("");
 
         group.WithParameterValidation(typeof(CreateUserRequest));

[Killed] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:17:9
 
         group.WithTags("Users");
 
-        group.WithParameterValidation(typeof(CreateUserRequest));
+        ;
 
         group.MapPost("/", async Task<Results<Ok, BadRequest<BadRequestResponse>>> (CreateUserRequest newUser, UserManager<TodoUser> userManager) =>
killedBy: TodoApi.Tests.UserApiTests.MissingUserOrPasswordReturnsBadRequest

[Killed] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:19:9
 
         group.WithParameterValidation(typeof(CreateUserRequest));
 
-        group.MapPost("/", async Task<Results<Ok, BadRequest<BadRequestResponse>>> (CreateUserRequest newUser, UserManager<TodoUser> userManager) =>
-        {
-            var result = await userManager.CreateAsync(new() { UserName = newUser.Username }, newUser.Password);
-
-            if (result.Succeeded)
-            {
-                return TypedResults.Ok();
-            }
-
-            return TypedResults.BadRequest(BadRequestResponse.BuildFrom(result.Errors.ToDictionary(e => e.Code, e => new[] { e.Description })));
-        }).DescribeCreateUser();
+        ;
 
         group.MapPost("/token", async Task<Results<BadRequest<BadRequestResponse>, Ok<TokenResponse>>> (CreateUserRequest userInfo, UserManager<TodoUser> userManager, ITokenService tokenService) =>
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser

[Killed] Negate expression
TodoApi/TodoApi/Users/UsersApi.cs:23:17
         {
             var result = await userManager.CreateAsync(new() { UserName = newUser.Username }, newUser.Password);
 
-            if (result.Succeeded)
+            if (!(result.Succeeded))
             {
                 return TypedResults.Ok();
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser

[Killed] Block removal mutation
TodoApi/TodoApi/Users/UsersApi.cs:24:13
             var result = await userManager.CreateAsync(new() { UserName = newUser.Username }, newUser.Password);
 
             if (result.Succeeded)
-            {
-                return TypedResults.Ok();
-            }
+            {}
 
             return TypedResults.BadRequest(BadRequestResponse.BuildFrom(result.Errors.ToDictionary(e => e.Code, e => new[] { e.Description })));
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser

[Killed] Statement mutation
TodoApi/TodoApi/Users/UsersApi.cs:31:9
             return TypedResults.BadRequest(BadRequestResponse.BuildFrom(result.Errors.ToDictionary(e => e.Code, e => new[] { e.Description })));
         }).DescribeCreateUser();
 
-        group.MapPost("/token", async Task<Results<BadRequest<BadRequestResponse>, Ok<TokenResponse>>> (CreateUserRequest userInfo, UserManager<TodoUser> userManager, ITokenService tokenService) =>
-        {
-            var user = await userManager.FindByNameAsync(userInfo.Username);
-
-            if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
-            {
-                return TypedResults.BadRequest(default(BadRequestResponse));
-            }
-
-            return TypedResults.Ok(new TokenResponse(tokenService.GenerateToken(user.UserName!)));
-        }).DescribeToken();
+        ;
 
         return group;
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
TodoApi/TodoApi/Users/UsersApi.cs:35:33
         {
             var user = await userManager.FindByNameAsync(userInfo.Username);
 
-            if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
+            if (user is null || await userManager.CheckPasswordAsync(user, userInfo.Password))
             {
                 return TypedResults.BadRequest(default(BadRequestResponse));
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Killed] Negate expression
TodoApi/TodoApi/Users/UsersApi.cs:35:17
         {
             var user = await userManager.FindByNameAsync(userInfo.Username);
 
-            if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
+            if (!(user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password)))
             {
                 return TypedResults.BadRequest(default(BadRequestResponse));
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[NoCoverage] Block removal mutation
TodoApi/TodoApi/Users/UsersApi.cs:36:13
             var user = await userManager.FindByNameAsync(userInfo.Username);
 
             if (user is null || !await userManager.CheckPasswordAsync(user, userInfo.Password))
-            {
-                return TypedResults.BadRequest(default(BadRequestResponse));
-            }
+            {}
 
             return TypedResults.Ok(new TokenResponse(tokenService.GenerateToken(user.UserName!)));
